# homebrew repositories
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# ----- ----- ----- -----
# dependencies

# node / work related
brew "fnm" # node version manager
brew "hyperfine" # performance test toll
brew "git" # version control
brew "neovim" # text editor

# personal tools
brew "tmux" # terminal multiplexer
brew "openssh" # ssh command
brew "yadm" # dotfiles manager

# enhanced tools
brew "eza" # enchanced ls command
brew "fzf" # enhanced fuzzyfinder - used by tmux and neovim
brew "ripgrep" # enhanced grep command - used by telescope.nvim
brew "zoxide" # enhanced cd command

# misc
brew "neofetch" # system details
brew "gnupg" # encryption and signing
brew "starship" # bash prompt customization

# ----- ----- ----- -----
# macos applications installed via homebrew

# appearance customization
cask "font-hack-nerd-font" # nerd font with pretty icons

# usability
cask "alt-tab" # alt-tab windows like
cask "karabiner-elements" # keyboard mappings
cask "rectangle" # window manager

# work related
cask "alacritty" # terminal
cask "visual-studio-code" # visual code

# personal tools
cask "thunderbird" # email client

